import React, { Component, Fragment } from 'react';

export default class DescriptionPageDoc extends Component {
    state = {}
    render() {
        return (
            <Fragment>
                <section className="example">

                <h1 className="title">Дизайн система</h1>

                <p className="text">
                    Дизайн-система — это набор ценностей бренда, инструментов и компонентов, который упрощает создание, тестирование, визуальное и техническое обновление продуктов, а также обеспечивает единообразие их интерфейсов.
                 </p>
                <p className="text">
                    Джереми Кит (Jeremy Keith), ирландский веб-дизайнер и писатель, говорит о дизайн-системе так:<br/>
                    «…Она включает в себя библиотеки шаблонов, руководства по стилю и другие объекты. Но не обманитесь: даже самый полный набор шаблонов никогда не станет для вас дизайн-системой. Потому что система — это не сами компоненты, а то, что связывает их воедино. Это правила и ограничения, которые указывают, как эти шаблоны работают вместе, когда и где целесообразно использовать каждый».
                </p>

                <h2 className="title">Из чего состоит дизайн-система?</h2>

                <p className="text">
                    Дизайн-система должна включать в себя четыре необходимых элемента:
<br/>
                <ol>
                    <b><li>Визуальный язык. Принципы создания интерфейсов продуктов.</li></b>
                Правила, на основании которых принимаются дизайн-решения (в том числе философия — миссия и ценности — компании, фирменный стиль и др.);
                Руководство по работе над продуктами с примерами;
                Набор компонентов, включая цвета, типографику, размерности, модульную сетку и др.
                    <b><li>Библиотека компонентов в коде</li></b>
                Набор шаблонов для каждого используемого дизайнерами инструмента, чтобы создавать прототипы и реализовывать продукты.
                    <b><li>Шаблоны для дизайнерских инструментов</li></b>
                Набор элементов, отражающих стили;
                Базовые компоненты (кнопки, инпуты и др.);
                Встраиваемые блоки (попапы, формы, шапки и др.).
                    <b><li>Команда дизайн-системы</li></b>
                Грамотно организованная работа сотрудников, работающих над проектом: идеологов, принимающих решения, менеджеров и исполнителей — дизайнеров и разработчиков.
                </ol>
                </p>
                <h2 className="title">Зачем нужна дизайн-система?</h2>
                <p className="text">
                Дизайн система помогает
                    <ul>
                        <li>ускорить процесс создания проекта</li>
                        <li>автоматизирует работу</li>
                        <li>удешевляет производство</li>
                        <li>структурирует рабочий процесс</li>
                    </ul>
                </p>
                </section>
            </Fragment>
        );
    }
}

