const statues = [
        "Отчёт не сдаётся из NR",
        "Отчет не рассчитан",
        "Расчет отчета за дату произведён",
        "Отчёт за дату проверен",
        "Отчёт сдан в проверяющий орган"
];

const colorList = [
    {
            "Отчёт не сдаётся из NR": {
                "status": "Отчёт не сдаётся из NR",
                "color": "#e582e1"
            },
            "Отчет не рассчитан": {
                "status": "Отчет не рассчитан",
                "color": "#ff6975"
            },
            "Расчет отчета за дату произведён": {
                "status": "Расчет отчета за дату произведён",
                "color": "#f1a059"
            },
            "Отчёт за дату проверен": {
                "status": "Отчёт за дату проверен",
                "color": "#8fc4f2"
            },
            "Отчёт сдан в проверяющий орган": {
                "status": "Отчёт сдан в проверяющий орган",
                "color": "#5ae891"
            }
    }
];

export {colorList, statues}
