const statues = [
        "Отчёт не сдаётся из NR",
        "Отчет не рассчитан",
        "Расчет отчета за дату произведён",
        "Отчёт за дату проверен",
        "Отчёт сдан в проверяющий орган"
];

const colorList = [
    {
            "Отчёт не сдаётся из NR": {
                "status": "Отчёт не сдаётся из NR",
                "color": "#8056CD"
            },
            "Отчет не рассчитан": {
                "status": "Отчет не рассчитан",
                "color": "#5680cd"
            },
            "Расчет отчета за дату произведён": {
                "status": "Расчет отчета за дату произведён",
                "color": "#56cd80"
            },
            "Отчёт за дату проверен": {
                "status": "Отчёт за дату проверен",
                "color": "#cd8056"
            },
            "Отчёт сдан в проверяющий орган": {
                "status": "Отчёт сдан в проверяющий орган",
                "color": "#cd5680"
            }
    }
];

const colorScheme = [
    "#8056CD",
    "#5680cd",
    "#56cd80",
    "#80cd56",
    "#cd8056",
    "#cd5680",


    "#57DAFF",
    "#57ffda",
    "#daff57",
    "#ffda57",
    "#ff57da",
    "#da57ff"
];

export {colorList, statues}
